---
kind: other
id: Properties.T:Autodesk.Revit.DB.ElementArrayIterator
source: html/cc7cd9f6-c454-15f3-dc62-cd594e9145da.htm
---
# ElementArrayIterator Properties

Retrieves the item that is the current focus of the iterator.